"action.adjustDate" = "Adjust Date";
"action.airDrop" = "AirDrop";
"action.album" = "Photo Album";
"action.appAction" = "App Action";
"action.appIntent" = "App (Intent)";
"action.appleScript" = "AppleScript";
"action.automation" = "Personal Automation";
"action.automationRun" = "Automation Run";
"action.base64Encode" = "Base64 Encode/Decode";
"action.bluetooth" = "Bluetooth";
"action.bookmark" = "Bookmark";
"action.box" = "Box";
"action.calculate" = "Calculate";
"action.calendar" = "Calendar";
"action.camera" = "Camera";
"action.changeCase" = "Change Case";
"action.chooseFromMenu" = "Choose from Menu";
"action.clearRecents" = "Clear Recents";
"action.clipText" = "Clipboard Text";
"action.clipboardAction" = "Clipboard Action";
"action.combineText" = "Combine Text";
"action.comment" = "Comment";
"action.coordinateClick" = "Coordinate Click";
"action.count" = "Count";
"action.createNote" = "Create Note";
"action.createShortcutIcon" = "Create Shortcut Icon";
"action.cropImage" = "Crop Image";
"action.darkMode" = "Dark Mode";
"action.date" = "Date";
"action.dateFormatter" = "Date Formatter";
"action.detectLanguage" = "Detect Language";
"action.devicesAndSheet" = "Devices & Sheet";
"action.dialog" = "Dialog";
"action.documentsAndFiles" = "Documents & Files";
"action.drive" = "OneDrive";
"action.editDocument" = "Edit Document";
"action.email" = "Email";
"action.emailData" = "Email Data";
"action.endRepeat" = "End Repeat";
"action.externalStorage" = "External Storage";
"action.extractArchive" = "Extract Archive";
"action.file" = "File / Folder";
"action.fileActions" = "File Actions";
"action.findApp" = "Find App";
"action.findAutomation" = "Find Automation";
"action.focusMode" = "Focus Mode";
"action.formatNumber" = "Format Number";
"action.getAttachment" = "Get Attachment";
"action.getClipboard" = "Get Clipboard";
"action.getConfirmation" = "Get Confirmation";
"action.getDictionary" = "Get Dictionary";
"action.getFiles" = "Get Files";
"action.getLastPhoto" = "Get Last Photo";
"action.hash" = "Hash";
"action.htmlToMarkdown" = "HTML to Markdown";
"action.ifElse" = "If/Otherwise";
"action.imagePlayground" = "Image Playground";
"action.javaScriptForAutomation" = "JavaScript for Automation";
"action.launchApp" = "Launch App / Toggle";
"action.listActions" = "List Actions";
"action.location" = "Location";
"action.macro" = "Record Macro";
"action.mail" = "Mail";
"action.map" = "Map";
"action.matchText" = "Match Text";
"action.math" = "Math";
"action.measurement" = "Measurement";
"action.menuCommand" = "Menu Command";
"action.message" = "Message";
"action.moveFiles" = "Move Files";
"action.moveMedia" = "Move Media";
"action.moveToFront" = "Move to Front";
"action.musicAndVideo" = "Music & Video";
"action.network" = "Wi-Fi";
"action.newDocument" = "New Document";
"action.newNote" = "New Note";
"action.newQuickNote" = "Quick Note";
"action.news" = "News";
"action.noteActions" = "Note Actions";
"action.number" = "Number";
"action.oneDrive" = "OneDrive";
"action.outputDifference" = "Output Difference";
"action.outputToVariable" = "Output to Variable";
"action.paste" = "Paste";
"action.pauseUntilInput" = "Pause Until Input";
"action.pdf" = "PDF";
"action.photos" = "Photos";
"action.playMusic" = "Play Music";
"action.playPodcast" = "Play Podcast";
"action.podcasts" = "Podcasts";
"action.presentation" = "Presentation";
"action.preventSleep" = "Prevent Sleep";
"action.quickLook" = "Quick Look";
"action.radio" = "Radio";
"action.randomPhoto" = "Random Photo";
"action.readTable" = "Read Table";
"action.recognizeAnimal" = "Recognize Animal";
"action.recognizeText" = "Recognize Text";
"action.regex" = "Regular Expression";
"action.reminders" = "Reminders";
"action.renameFiles" = "Rename Files";
"action.repeatEach" = "Repeat Each";
"action.repeatLoop" = "Repeat";
"action.replaceText" = "Replace Text";
"action.rotateImage" = "Rotate Image";
"action.runScriptInShell" = "Run Script in Shell";
"action.runShortcut" = "Run Shortcut";
"action.saveOutput" = "Save Output";
"action.scanQRCode" = "Scan QR Code";
"action.screenshot" = "Screenshot";
"action.script" = "Script";
"action.setClipboard" = "Set Clipboard";
"action.setMailBody" = "Set Mail Body";
"action.setMailRecipients" = "Set Mail Recipients";
"action.setParagraphStyle" = "Set Paragraph Style";
"action.setVariable" = "Set Variable";
"action.setVolumeMedia" = "Media Volume";
"action.slideshow" = "Slideshow";
"action.sort" = "Sort";
"action.splitText" = "Split Text";
"action.stocks" = "Stocks";
"action.stopShortcut" = "Stop Shortcut";
"action.stopwatch" = "Stopwatch";
"action.surroundText" = "Surround Text";
"action.system" = "System";
"action.takeScreenshot" = "Take Screenshot";
"action.text" = "Text";
"action.textEditShortcut" = "Text Editor Shortcut";
"action.timer" = "Timer";
"action.translate" = "Translate";
"action.transportation" = "Transportation";
"action.trigger" = "Trigger";
"action.trimVideo" = "Trim Video";
"action.trimWhitespace" = "Trim Whitespace";
"action.tuneStation" = "TuneIn Radio";
"action.typeDateTime" = "Type Date/Time";
"action.typeNumber" = "Type Number";
"action.typeText" = "Type Text";
"action.url" = "URL";
"action.useModel" = "Use Model";
"action.uuid" = "UUID";
"action.variableDetail" = "Variable Detail";
"action.videoDownloader" = "Video Downloader";
"action.viewDocument" = "View Document";
"action.viewPhotos" = "View Photos";
"action.wait" = "Wait";
"action.wakeDisplay" = "Wake Display";
"action.wallpaper" = "Wallpaper";
"action.webContent" = "Web Content";
"action.webIntegration" = "Web Integration";
"action.wordCount" = "Word Count";
"action.writingTool" = "Writing Tool";
"ai.display_image_style" = "Create Image (%@)";
"ai.display_model_use" = "Use Model (%@ → %@)";
"ai.error_ai_disabled" = "Apple Intelligence is not enabled. Turn it on in System Settings > Apple Intelligence";
"ai.error_cancelled" = "Cancelled by the user";
"ai.error_chatgpt_ext" = "ChatGPT Extension is not installed";
"ai.error_content_filtered" = "Blocked by the content filter";
"ai.error_follow_up" = "Follow Up mode is not supported yet";
"ai.error_invalid_response" = "Invalid response";
"ai.error_model_not_available" = "%@ model is unavailable";
"ai.error_network" = "Network error: %@";
"ai.error_output_conversion" = "Cannot convert the response to %@ type";
"ai.error_prompt_empty" = "Prompt is empty";
"ai.error_timeout" = "Response timed out";
"ai.error_token_limit" = "Token limit exceeded";
"ai.error_unsupported_os" = "This feature requires macOS 26 (Tahoe) or later";
"ai.image.animation" = "Animation";
"ai.image.badge_fmt" = "ImagePlayground - %@";
"ai.image.illustration" = "Illustration";
"ai.image.placeholder_fmt" = "Generating image\n(%@)";
"ai.image.sketch" = "Sketch";
"ai.output.app_entity" = "App Entity";
"ai.output.boolean" = "Boolean";
"ai.output.dictionary" = "Dictionary";
"ai.output.list" = "List";
"ai.output_desc_app_entity" = "App data entity, e.g., Find action results";
"ai.output_desc_bool" = "Yes/No judgment, usable directly in If";
"ai.output_desc_dict" = "Key-value pairs, JSON-parseable";
"ai.output_desc_list" = "List items, works with Repeat with Each";
"ai.output_desc_text" = "Natural-language response, suited to follow-up text";
"ai.prompt.conversation_header" = "Previous conversation:";
"ai.prompt.role_ai" = "AI";
"ai.prompt.role_user" = "User";
"ai.provider.ask_each" = "Ask Each Time";
"ai.provider.on_device" = "On-Device";
"ai.provider_desc_ask_each" = "Choose the model each time it runs";
"ai.provider_desc_chatgpt" = "Uses ChatGPT. Broad knowledge, external service integration";
"ai.provider_desc_ond" = "Runs on device without internet. Suited to simple tasks";
"ai.provider_desc_pcloud" = "Processed on Apple servers. Suited to complex tasks, privacy-preserving";
"ai.state_ai_disabled" = "Apple Intelligence disabled (enable in System Settings)";
"ai.state_available" = "Available";
"ai.state_checking" = "Checking…";
"ai.state_model_unavailable" = "Model unavailable: %@";
"ai.state_unsupported_os" = "Requires macOS %@ or later";
"ai.tone.casual" = "Casual";
"ai.tone.code_casual" = "[Casual]\n";
"ai.tone.code_concise" = "[Concise]\n";
"ai.tone.code_educational" = "[Educational]\n";
"ai.tone.code_formal" = "[Formal]\n";
"ai.tone.code_friendly" = "[Friendly]\n";
"ai.tone.code_professional" = "[Professional]\n";
"ai.tone.concise" = "Concise";
"ai.tone.educational" = "Educational";
"ai.tone.formal" = "Formal";
"ai.tone.friendly" = "Friendly";
"ai.tone.professional" = "Professional";
"ai.tool_analysis" = "Analysis";
"ai.tool_coding" = "Coding";
"ai.tool_creative" = "Creative";
"ai.tool_custom" = "Custom";
"ai.tool_translation" = "Translation";
"ai.tool_writing" = "Writing";
"ai.writing.change_tone" = "Change Tone";
"ai.writing.key_points" = "Key Points";
"ai.writing.make_list" = "Make List";
"ai.writing.make_table" = "Make Table";
"ai.writing.proofread" = "Proofread";
"ai.writing.result_proofread_fmt" = "[Proofread] %@";
"ai.writing.result_rewrite_fmt" = "[Rewrite] %@";
"ai.writing.rewrite" = "Rewrite";
"ai.writing.summarize" = "Summarize";
"ai.writing_desc_change_tone" = "Changes the tone (professional, friendly, concise, etc.)";
"ai.writing_desc_key_points" = "Extracts key points from text";
"ai.writing_desc_make_list" = "Extracts lists from text";
"ai.writing_desc_make_table" = "Generates a table from text";
"ai.writing_desc_proofread" = "Fixes spelling, grammar, and punctuation";
"ai.writing_desc_rewrite" = "Rewrites text in another style";
"ai.writing_desc_summarize" = "Summarizes long text";
"alert.menubar_cannot_disable.message" = "If both Menu Bar and Dock are disabled, you cannot access the app. Enable Show in Dock first.";
"alert.menubar_cannot_disable.title" = "Cannot Disable Menu Bar";
"appearance.dark" = "Dark";
"appearance.light" = "Light";
"appearance.loading" = "Loading theme…";
"appearance.mode" = "Appearance Mode";
"appearance.picker" = "Appearance";
"appearance.preset" = "Theme Preset";
"appearance.reset_help" = "Reset to default size";
"appearance.system" = "System";
"appearance.text_size" = "Text Size";
"category.accessories" = "Devices & Web";
"category.app.business" = "Business";
"category.app.education" = "Education";
"category.app.games" = "Games";
"category.app.music" = "Music";
"category.app.other" = "Other";
"category.app.photo_video" = "Photo & Video";
"category.app.productivity" = "Productivity";
"category.app.social_networking" = "Social Networking";
"category.app.utilities" = "Utilities";
"category.appIntents" = "Apps";
"category.automation" = "Automation";
"category.content" = "Content Creation";
"category.documents" = "Documents";
"category.essential" = "Essential";
"category.flowControl" = "Flow Control";
"category.location" = "Location & Transit";
"category.media" = "Media";
"category.scripting" = "Coding/Scripting";
"color.name.blue" = "Blue";
"color.name.brown" = "Brown";
"color.name.cyan" = "Cyan";
"color.name.gray" = "Gray";
"color.name.green" = "Green";
"color.name.indigo" = "Indigo";
"color.name.mint" = "Mint";
"color.name.orange" = "Orange";
"color.name.pink" = "Pink";
"color.name.purple" = "Purple";
"color.name.red" = "Red";
"color.name.teal" = "Teal";
"color.name.yellow" = "Yellow";
"condition.op.contains" = "Contains";
"condition.op.ends_with" = "Ends With";
"condition.op.equal" = "Equals";
"condition.op.greater_or_equal" = "Greater Than or Equal";
"condition.op.greater_than" = "Greater Than";
"condition.op.is_empty" = "Is Empty";
"condition.op.is_not_empty" = "Is Not Empty";
"condition.op.less_or_equal" = "Less Than or Equal";
"condition.op.less_than" = "Less Than";
"condition.op.matches" = "Matches Regex";
"condition.op.not_contains" = "Does Not Contain";
"condition.op.not_equal" = "Not Equals";
"condition.op.starts_with" = "Starts With";
"ai.error_not_implemented" = "Apple Intelligence integration is not implemented yet";
"error.user.action_failed_fmt" = "Failed to run action: %@";
"error.user.empty_script" = "Script is empty.";
"error.user.foundation_models_unavailable" = "FoundationModels framework is unavailable";
"error.user.script_failed" = "Failed to run script";
"flow.constant_dict_fmt" = "{%lld keys}";
"flow.constant_list_fmt" = "[%lld items]";
"flow.false" = "False";
"flow.if_fmt" = "If %@";
"flow.menu_fmt" = "Menu Selection (%lld options)";
"flow.preview_dict_fmt" = "%lld keys";
"flow.preview_list_fmt" = "%lld items";
"flow.repeat.count" = "Repeat Count";
"flow.repeat.each" = "For Each Item";
"flow.repeat.while" = "Repeat While";
"flow.repeat_count_fmt" = "Repeat %lld times";
"flow.true" = "True";
"flow.value_empty" = "No Value";
"flow.value_image" = "Image";
"flow.value_none" = "None";
"macro.title_fmt" = "Macro (%lld keys)";
"menu.action.status_app_not_running" = "Target app is not running";
"menu.action.status_menu_not_found" = "Menu item not found";
"menu.action.status_no_permission" = "No accessibility permission";
"menu.action.status_automation_denied" = "Automation permission denied (System Settings → Privacy & Security → Automation)";
"menu.action.status_timeout" = "Menu action timed out (5s)";
"menu.action.status_success" = "Success";
"repeat.custom" = "Custom";
"repeat.daily" = "Daily";
"repeat.monthly" = "Monthly";
"repeat.none" = "Once";
"repeat.weekdays" = "Weekdays";
"repeat.weekends" = "Weekends";
"repeat.weekly" = "Weekly";
"settings.display" = "Display";
"settings.language" = "Language";
"settings.language.english" = "English";
"settings.language.korean" = "한국어";
"settings.language.restart_required" = "Language change takes effect after app restart.";
"settings.language.system" = "Follow System";
"settings.launch_at_login" = "Launch at Login";
"settings.menu_hud" = "Menu Shortcut HUD";
"settings.menu_hud.change" = "Change Hotkey";
"settings.menu_hud.current" = "Current";
"settings.menu_hud.description" = "Show all menu shortcuts of frontmost app (default ⇧⌥S).";
"settings.menu_hud.reset" = "Restore Default";
"settings.menu_hud.style" = "Display Style";
"settings.menu_hud.style.floating" = "Floating Window";
"settings.menu_hud.style.fullscreen" = "Full Screen";
"settings.panel_hotkey" = "Panel Hotkey";
"settings.panel_hotkey.change" = "Change Hotkey";
"settings.panel_hotkey.current" = "Current";
"settings.panel_hotkey.description" = "Global hotkey to open/close main panel (default ⇧⌥A).";
"settings.panel_hotkey.reset" = "Restore Default";
"settings.permissions" = "Permissions";
"settings.permissions.accessibility" = "Accessibility";
"settings.permissions.accessibility.description" = "Required for menu shortcut enumeration/execution and controlling other apps.";
"settings.permissions.accessibility.granted" = "✅ Granted";
"settings.permissions.accessibility.request" = "Request Permission";
"settings.show_hidden_apps" = "Show Hidden Apps";
"settings.show_in_dock" = "Show in Dock";
"settings.show_in_dock.description" = "If Dock is also disabled, you cannot access the app. Enable Show in Dock first.";
"settings.show_in_menubar" = "Show in Menu Bar";
"settings.show_in_menubar.description" = "Menu bar icon will disappear when turned off.";
"settings.show_system_apps" = "Show System Apps";
"settings.theme" = "Theme";
"settings.title" = "Settings";
"step.executed_fmt" = "Run %lld times";
"step.executed_never" = "Never Run";
"step.executed_once" = "Run once";
"step.keys_fmt" = "%lld keys";
"step.last_run_none" = "No Run History";
"step.menu_options_fmt" = "Menu: %lld items";
"step.number_fmt" = "Number: %@";
"step.repeat_count_fmt" = "Repeat %lld times";
"step.run_shortcut_fmt" = "Run Shortcut: %@";
"step.shell_fmt" = "Shell: %@";
"step.wait_fmt" = "%@s";
"system.action.dark_mode" = "Toggle Dark Mode";
"system.action.display_sleep" = "Turn Off Display";
"system.action.dock_restart" = "Restart Dock";
"system.action.finder_restart" = "Restart Finder";
"system.action.lock" = "Lock Screen";
"system.action.mute" = "Toggle Mute";
"system.action.screen_saver" = "Screen Saver";
"system.action.sleep" = "Sleep";
"toast.hotkey_duplicate" = "This hotkey is already in use.";
"toast.script_test_failed" = "Script test failed";
"toast.script_test_success" = "Script test succeeded";
"trigger.filesystem" = "File System";
"trigger.hardware" = "Hardware";
"trigger.network" = "Network";
"trigger.power" = "Power";
"trigger.system" = "System";
"trigger.time" = "Time";
"ui.about.app_name" = "ApexKey";
"ui.about.tagline" = "The global hotkey manager at the top";
"ui.about.version" = "Version %@";
"ui.add" = "Add";
"ui.app_detail.bundle_id" = "Bundle ID";
"ui.app_detail.clipboard_prompt" = "Enter text to paste (leave empty for clipboard)";
"ui.app_detail.coordinate_prompt" = "Enter x,y coordinates (e.g., 500,400)";
"ui.app_detail.file_prompt" = "Enter file/folder path";
"ui.app_detail.keycode_prompt" = "Enter keycodes separated by commas";
"ui.app_detail.menu_note" = "Menu commands are selected directly from the action catalog";
"ui.app_detail.no_settings" = "This action requires no additional settings";
"ui.app_detail.run_app_prompt" = "Select an app to run";
"ui.app_detail.shell_prompt" = "Enter shell command";
"ui.app_detail.target_prompt" = "Enter target";
"ui.app_detail.url_prompt" = "Enter URL";
"ui.app_detail.wait_prompt" = "Enter wait time in seconds";
"ui.app_detail.wait_until" = "Wait until ⌘⇧↩ is pressed";
"ui.app_label" = "Apps";
"ui.appdetail.accessibility_required" = "Accessibility permission is required.";
"ui.appdetail.add_hotkey" = "Add Hotkey";
"ui.appdetail.back_to_list" = "Back to List";
"ui.appdetail.change_category" = "Change Category";
"ui.appdetail.change_hotkey" = "Change Hotkey";
"ui.appdetail.configured_hotkeys" = "Configured Global Hotkeys";
"ui.appdetail.execute_then_menu" = "Execute %@, then perform menu command";
"ui.appdetail.front" = "Bring %@ to Front";
"ui.appdetail.hotkey_for_scheme" = "Set hotkey to open this scheme";
"ui.appdetail.menu_hotkeys" = "%@ Menu Shortcuts";
"ui.appdetail.no_hotkey" = "None — Set Run/Focus/Toggle Hotkey";
"ui.appdetail.no_hotkey_assigned" = "No shortcut assigned. Select from menu shortcuts below to add.";
"ui.appdetail.no_menu_items" = "No menu items with shortcuts found. Launch the app first.";
"ui.appdetail.no_search_results" = "No search results.";
"ui.appdetail.no_urlscheme" = "This app does not support URL schemes.";
"ui.appdetail.open_url" = "Open URL";
"ui.appdetail.record_hotkey" = "Record Hotkey";
"ui.appdetail.refresh" = "Refresh";
"ui.appdetail.run_app" = "Run %@";
"ui.appdetail.run_globally" = "Run Globally";
"ui.appdetail.run_toggle" = "Run/Toggle %@";
"ui.appdetail.run_toggle_label" = "Run/Toggle App";
"ui.appdetail.scheme_count" = "%lld";
"ui.appdetail.search_menu_commands" = "Search menu commands";
"ui.appdetail.submenu" = "Submenu";
"ui.appdetail.try_urlscheme" = "Open %@://";
"ui.appdetail.urlscheme_unavailable" = "App path could not be verified to read URL schemes.";
"ui.apps.add_app" = "Add App";
"ui.apps.all_apps" = "All Apps";
"ui.apps.count" = "%lld apps";
"ui.apps.hide" = "Hide";
"ui.apps.no_apps" = "No Apps";
"ui.apps.unhide" = "Unhide";
"ui.automation.add_trigger" = "Add New Trigger";
"ui.automation.battery" = "Battery";
"ui.automation.charger" = "Charger";
"ui.automation.file" = "File Watch";
"ui.automation.folder" = "Folder Watch";
"ui.automation.macos_only" = "%@ triggers require macOS 26 or later.";
"ui.automation.no_triggers" = "No registered automations. Add triggers below.";
"ui.automation.title" = "Automation";
"ui.automation.subtitle" = "Manage automation triggers across workflows";
"ui.automation.new" = "New Automation";
"ui.automation.edit" = "Edit";
"ui.automation.choose_workflow" = "Choose a workflow to automate";
"ui.automation.trigger_count" = "%lld triggers";
"ui.automation.no_workflows" = "Create a workflow first.";
"ui.automation.no_automations" = "No automations registered.";
"ui.station.preset_add" = "Add Preset";
"ui.station.preset_title" = "Add System Presets";
"ui.station.preset_intro" = "Add the selected presets as one-step workflows.";
"ui.station.preset_selected" = "%lld selected";
"ui.station.preset_confirm" = "Add";
"ui.app_detail.select_system" = "Select a system preset";
"ui.automation.personal" = "Personal Automation";
"ui.automation.time" = "Time (Schedule)";
"ui.automation_label" = "Automation";
"ui.binding.duplicate_fmt" = "%@ (duplicate)";
"ui.browse" = "Browse";
"ui.cancel" = "Cancel";
"ui.catalog.add_action" = "Add Action";
"ui.catalog.all" = "All";
"ui.catalog.state_planned" = "Coming soon";
"ui.catalog.state_stub" = "Not integrated";
"ui.catalog.show_unavailable" = "Show %d unavailable";
"ui.catalog.hide_unavailable" = "Hide %d unavailable";
"ui.catalog.no_results" = "No search results";
"ui.category" = "Category";
"ui.clear" = "Clear";
"ui.cmd_ctrl_shift_option" = "⌘ CMD  ·  ⌃ Ctrl  ·  ⇧ Shift  ·  ⌥ Option  ·  🌐 Globe";
"ui.command" = "Command";
"ui.condition.value" = "Value";
"ui.copy" = "Copy";
"ui.default_optional" = "Default Value (Optional)";
"ui.delete" = "Delete";
"ui.description" = "Description";
"ui.done" = "Done";
"ui.edit" = "Edit";
"ui.editor.automation_help" = "Personal Automation Triggers";
"ui.editor.delete_all" = "Delete All";
"ui.editor.drag_hint" = "Drag steps to reorder";
"ui.editor.edit_mode" = "Edit Mode";
"ui.editor.new_variable" = "New Variable";
"ui.editor.option_default" = "Option 1";
"ui.editor.select_all" = "Select All";
"ui.editor.step_choose_menu" = "Choose from Menu";
"ui.editor.step_click" = "Click";
"ui.editor.step_clipboard" = "Clipboard";
"ui.editor.step_comment" = "Comment";
"ui.editor.step_file" = "File";
"ui.editor.step_image" = "Create Image";
"ui.editor.step_launch_app" = "Select App";
"ui.editor.step_lock" = "Lock";
"ui.editor.step_menu" = "Menu Command";
"ui.editor.step_output_var" = "Output to Variable";
"ui.editor.step_pause" = "Pause Until Input";
"ui.editor.step_repeat" = "Repeat";
"ui.editor.step_repeat_each" = "Repeat Each";
"ui.editor.step_script" = "Script";
"ui.editor.step_set_var" = "Set Variable";
"ui.editor.step_type" = "Type Keys";
"ui.editor.step_use_model" = "Use Model";
"ui.editor.step_wait" = "Wait 1 sec";
"ui.editor.step_writing_tool" = "Writing Tool";
"ui.editor.steps_count" = "%lld steps";
"ui.editor.toggle_all_skips" = "Toggle All Skips";
"ui.hotkey" = "Hotkey";
"ui.hud.close_hint" = "Close with ESC";
"ui.hud.key_legend" = "⌘ CMD  ·  ⌃ Ctrl  ·  ⇧ Shift  ·  ⌥ Option  ·  🌐 Globe";
"ui.hud.show_no_shortcut" = "Show items without shortcuts";
"ui.info" = "Info";
"ui.label_optional" = "Label (Optional)";
"ui.launcher.no_match" = "No matching macros found";
"ui.launcher.search_macros" = "Search macros by name…";
"ui.log.auto_scroll" = "Auto Scroll";
"ui.log.filter_placeholder" = "Filter (E-MAC-… / tag / word)";
"ui.log.no_logs" = "No Logs";
"ui.main.always_on_top" = "Always on Top";
"ui.main.always_on_top_help" = "Keep Window Always on Top";
"ui.main.always_on_top_off" = "Disable Always on Top";
"ui.main.reclassify" = "Reclassify Categories";
"ui.main.reclassify_help" = "Automatically reclassify app categories (manually changed apps are kept)";
"ui.main.search_apps" = "Search Apps";
"ui.main.settings" = "Settings…";
"ui.main.settings_help" = "Settings (⌘,)";
"ui.menu.about" = "%@ Info";
"ui.menu.cut" = "Cut";
"ui.menu.debug_log" = "Debug Log";
"ui.menu.edit_shortcut" = "Edit Workflow";
"ui.menu.paste" = "Paste";
"ui.menu.quit" = "Quit %@";
"ui.menu.redo" = "Redo";
"ui.menu.select_all" = "Select All";
"ui.menu.step_settings" = "Step Settings";
"ui.menu.undo" = "Undo";
"ui.menu_cheat.footer_hint" = "ESC or ⇧⌥S to close · Enter to execute";
"ui.menu_cheat.menu_count" = "Menu Shortcuts %lld";
"ui.menu_cheat.no_items" = "No menu items with shortcuts found";
"ui.menu_cheat.no_match" = "No matching items";
"ui.menu_cheat.search_hint" = "Search shortcuts / commands (Enter to run)";
"ui.menu_cheat.sort_results" = "Search Results %lld";
"ui.model" = "Model";
"ui.name" = "Name";
"ui.open" = "Open";
"ui.options" = "Options";
"ui.output" = "Output";
"ui.output_type" = "Output Type";
"ui.path" = "Path";
"ui.prompt" = "Prompt";
"ui.quit" = "Quit";
"ui.recorder.duplicate" = "Duplicate hotkey. Try another combination.";
"ui.recorder.press_keys" = "Press keys…";
"ui.recorder.saved" = "Applied. Closing shortly.";
"ui.recorder.test_failed" = "Hotkey detected but execution failed. Check target app launch & permissions.";
"ui.recorder.test_success" = "Test succeeded! The workflow actually ran. Press Save to apply.";
"ui.recorder.testing" = "Testing — press the hotkey now";
"ui.recorder.unavailable" = "Unavailable hotkey. Try another combination.";
"ui.rename" = "Rename";
"ui.repeat" = "Repeat";
"ui.run" = "Run";
"ui.save" = "Save";
"ui.search" = "Search";
"ui.select_option" = "Select an option…";
"ui.settings.ok" = "OK";
"ui.shortcut" = "Workflow";
"ui.sidebar.all_apps" = "All Apps";
"ui.sidebar.app_shortcuts" = "App Shortcuts";
"ui.sidebar.ax_required" = "Accessibility Permission Required — Enable";
"ui.sidebar.ax_required_help" = "Accessibility permission required. Click to enable.";
"ui.sidebar.binding_counts" = "%lld shortcuts · %lld workflows";
"ui.sidebar.collapse" = "Collapse Sidebar";
"ui.sidebar.essential" = "Essential";
"ui.sidebar.expand" = "Expand Sidebar";
"ui.sidebar.tools" = "Tools";
"ui.skip" = "Skip";
"ui.station.assign_hotkey" = "Assign Hotkey";
"ui.station.assign_hotkey_help" = "Assign Global Run Hotkey";
"ui.station.create" = "Create";
"ui.station.delete_alert_message" = "%lld steps and the configured hotkey will be deleted together. This cannot be undone.";
"ui.station.delete_alert_title" = "Delete '%@' workflow?";
"ui.station.edit_steps" = "Edit Steps";
"ui.station.edit_steps_help" = "Add, reorder, delete steps";
"ui.station.empty" = "No registered workflows. Start with 'New Workflow' or 'Add Preset'.";
"ui.station.hotkey_subtitle" = "Pressing this hotkey runs all %lld steps in order";
"ui.station.hotkey_title" = "%@ Run Hotkey";
"ui.station.intro" = "Build a workflow by stacking steps like open app, key input, script, paste. Test with Run button and assign hotkey.";
"ui.station.intro2" = "Group multiple steps into one workflow to run and assign a hotkey";
"ui.station.name_placeholder" = "Name (e.g., Start Work)";
"ui.station.new_shortcut" = "New Workflow";
"ui.station.no_steps" = "No Steps";
"ui.station.run_all" = "Run all steps in order (test)";
"ui.station.separator" = "Separator";
"ui.step.duplicate" = "Duplicate";
"ui.step.empty_hint" = "Add actions from the action catalog on the left";
"ui.step.if_end" = "End If";
"ui.step.menu_end" = "End Menu";
"ui.step.move_down" = "Move Down";
"ui.step.move_up" = "Move Up";
"ui.step.repeat_end" = "End Repeat";
"ui.step.unskip" = "Unskip";
"ui.step_settings.allow_multiple" = "Allow Multiple Selection";
"ui.step_settings.collection_hint" = "Enter the ID of the variable that owns the collection (list).";
"ui.step_settings.collection_uuid" = "Collection Variable (UUID)";
"ui.step_settings.follow_up_chat" = "Follow Up (Chat)";
"ui.step_settings.general" = "General";
"ui.step_settings.if_condition" = "If Condition";
"ui.step_settings.input_uuid" = "Input Variable (UUID)";
"ui.step_settings.left_value" = "Left Value";
"ui.step_settings.menu_select" = "Select Menu";
"ui.step_settings.new_option" = "New Option";
"ui.step_settings.note" = "Note (Optional)";
"ui.step_settings.operator" = "Operator";
"ui.step_settings.optional_mark" = "Optional";
"ui.step_settings.otherwise_hint" = "Otherwise branch is managed by inserting steps under If.";
"ui.step_settings.repeat_count" = "Repeat (Count)";
"ui.step_settings.repeat_count_value" = "Repetitions: %lld";
"ui.step_settings.repeat_each" = "Repeat (Each Item)";
"ui.step_settings.right_value" = "Right Value";
"ui.step_settings.show_cancel" = "Show Cancel Button";
"ui.step_settings.skip" = "Skip this step";
"ui.step_settings.target_value" = "Target (Value)";
"ui.step_settings.variable_hint" = "This step sets this value to a variable during execution. Magic variable connections are configured in the variable panel.";
"ui.step_settings.variable_value" = "Variable Value";
"ui.style" = "Style";
"ui.target" = "Target";
"ui.test" = "Test";
"ui.text" = "Text";
"ui.title" = "Title";
"ui.tone" = "Tone";
"ui.trigger.activated" = "Activated";
"ui.trigger.all_devices" = "All Devices";
"ui.trigger.all_drives" = "All Drives";
"ui.trigger.all_focus" = "Any Focus";
"ui.trigger.all_networks" = "All Networks";
"ui.trigger.app_fmt" = "App: %@ [%@]";
"ui.trigger.battery_fmt" = "Battery %@ %lld%%";
"ui.trigger.bluetooth_fmt" = "Bluetooth: %@ [%@]";
"ui.trigger.charger_fmt" = "Charger [%@]";
"ui.trigger.connected" = "Connected";
"ui.trigger.deactivated" = "Deactivated";
"ui.trigger.disconnected" = "Disconnected";
"ui.trigger.display_fmt" = "Display [%@]";
"ui.trigger.drive_fmt" = "External Drive: %@ [%@]";
"ui.trigger.falls_below" = "Below";
"ui.trigger.file_fmt" = "File: %@";
"ui.trigger.focus_fmt" = "Focus: %@ [%@]";
"ui.trigger.folder_fmt" = "Folder: %@ [%@]%@";
"ui.trigger.modified" = "Modified";
"ui.trigger.reaches" = "Reaches";
"ui.trigger.renamed" = "Renamed";
"ui.trigger.rises_above" = "Above";
"ui.trigger.subfolder_suffix" = " (including subfolders)";
"ui.trigger.turned_off" = "Off";
"ui.trigger.turned_on" = "On";
"ui.trigger.wifi_disconnected" = "Disconnected";
"ui.trigger.wifi_fmt" = "Wi-Fi: %@ [%@]";
"ui.var.category_magic" = "Magic";
"ui.var.category_special" = "Special";
"ui.var.category_user" = "User";
"ui.var.create_help" = "Create New User Variable";
"ui.var.default_placeholder" = "Default";
"ui.var.magic_empty" = "No Magic Variables";
"ui.var.magic_hint" = "Created automatically when steps run";
"ui.var.manual_empty" = "No User Variables";
"ui.var.manual_hint" = "Create with the + button in the top right";
"ui.var.name_label" = "Variable Name";
"ui.var.new_variable" = "New User Variable";
"ui.var.type" = "Type";
"ui.variables" = "Variables";
"ui.window.about" = "ApexKey About";
"ui.window.debug_log" = "ApexKey Debug Log";
"ui.window.settings" = "ApexKey Settings";
"variable.boolean_false" = "False";
"variable.boolean_true" = "True";
"variable.image" = "[Image]";
"variable.special.ask_each_time" = "Ask Each Time";
"variable.special.ask_each_time.desc" = "Prompts for a value each time it runs";
"variable.special.battery_level" = "Battery Level";
"variable.special.battery_level.desc" = "The current battery charge level (0.0–1.0)";
"variable.special.clipboard" = "Clipboard";
"variable.special.clipboard.desc" = "Gets the current clipboard contents";
"variable.special.current_date" = "Current Date";
"variable.special.current_date.desc" = "Gets the current date and time";
"variable.special.device_name" = "Device Name";
"variable.special.device_name.desc" = "The name of this Mac";
"variable.special.last_result" = "Last Result";
"variable.special.last_result.desc" = "The result of the previous step";
"variable.special.repeat_index" = "Repeat Index";
"variable.special.repeat_index.desc" = "The current repeat count (starts at 1)";
"variable.special.repeat_item" = "Repeat Item";
"variable.special.repeat_item.desc" = "The current item being repeated";
"variable.special.shortcut_input" = "Shortcut Input";
"variable.special.shortcut_input.desc" = "Uses the input passed when the shortcut runs";
"variable.special.wifi_name" = "Wi-Fi Name";
"variable.special.wifi_name.desc" = "The name of the currently connected Wi-Fi network";
"variable.type.magic" = "Magic Variable";
"variable.type.manual" = "User Variable";
"variable.type.special" = "Special Variable";
"variable.value.any" = "Any Type";
"variable.value.boolean" = "Boolean";
"variable.value.date" = "Date";
"variable.value.dictionary" = "Dictionary";
"variable.value.file" = "File";
"variable.value.image" = "Image";
"variable.value.list" = "List";
"variable.value.number" = "Number";
"variable.value.text" = "Text";
"ui.step_settings.test_run" = "Run Test";
"ui.step_settings.test_output" = "Output";
"ui.step_settings.running" = "Running…";
"ui.step_settings.no_output" = "(no output)";
"ui.step_settings.exit_code" = "Exit code: %lld";

"launch.mode" = "Launch Mode";

"launch.mode.toggle" = "Toggle (hide if frontmost)";

"launch.mode.activate" = "Activate";

"launch.mode.launch" = "Launch only";

"launch.args" = "Arguments (optional)";

"launch.url_scheme" = "URL scheme (optional, takes priority)";

"ui.app_detail.search_app" = "Search apps (name or bundle ID)";

"ui.app_detail.applescript_prompt" = "Enter AppleScript";

"ui.app_detail.jxa_prompt" = "Enter JavaScript for Automation";

"ui.editor.step_applescript" = "AppleScript";

"ui.editor.step_jxa" = "Run JXA";

"ui.editor.step_shell" = "Shell script";

"palette.search.placeholder" = "Search workflows & hotkeys";

"palette.section.recent" = "Recent";

"palette.section.shortcuts" = "Workflows";

"palette.section.bindings" = "Hotkeys";

"palette.empty" = "No matches";

"settings.palette" = "Command palette";

"settings.palette.current" = "Current hotkey";

"settings.palette.description" = "Global hotkey to open the command palette anywhere (default ⌘⌥K)";

"settings.palette.change" = "Change hotkey";

"settings.palette.reset" = "Reset to default";

"palette.section.commands" = "Commands";

"palette.section.apps" = "Apps";

"palette.steps_fmt" = "%d steps";

"palette.cmd.new_shortcut" = "New workflow";

"palette.cmd.new_shortcut.name" = "New workflow";

"palette.cmd.open_settings" = "Open Settings";

"palette.cmd.open_panel" = "Open main panel";

"palette.cmd.menu_hud" = "Show Menu HUD";

"palette.cmd.repeat_last" = "Repeat last workflow";

"palette.cmd.quit" = "Quit ApexKey";

"action.keyCombo" = "Send Key Combo";

"ui.editor.step_keypress" = "Key Combo";

"keypress.none" = "Not set";

"keypress.record" = "Record combo";

"keypress.stop" = "Stop recording";

"keypress.recording" = "Press keys with modifiers…";

"keypress.hint" = "Records a key pressed with modifiers (⌘⌥⇧⌃). Use Macro for bare keys.";

"keypress.test" = "Test send";

"keypress.clear" = "Clear";

"palette.section.steps" = "Step contents";

"palette.clear" = "Clear";

"ui.app_detail.change_app" = "Change";

"ui.app_detail.app_count_fmt" = "%d shown";
"ui.close" = "Close";
"ui.step_settings.view_result" = "View Result";
"system.action.android_mirror" = "Android Remote Mirror (scrcpy)";
"error.user.script_file_missing" = "Script file not found.";
"settings.toast" = "Run Notifications";
"settings.toast.success" = "Show success notifications";
"settings.toast.success.description" = "When off, only failures are shown.";
"toast.reason.hotkey_duplicate" = "This shortcut is already in use";
"toast.reason.hotkey_register_failed" = "Could not register the shortcut. Another app may be using it.";
"toast.reason.hotkey_save_failed" = "Could not save the shortcut";
"toast.reason.app_missing" = "App not found (check bundle ID / path)";
"toast.reason.launch_failed" = "Failed to launch app (check install / permissions)";
"toast.reason.scheme_invalid" = "Invalid URL scheme";
"toast.reason.key_invalid" = "Invalid key combo format ('keyCode:modifiers')";
"toast.reason.key_send_failed" = "Key press failed (check Accessibility permission)";
"toast.reason.url_invalid" = "Invalid URL";
"toast.reason.unimplemented" = "Unsupported action";
"ui.system.script_file" = "File: %@";
"ui.system.script_modified" = "Modified · needs save";
"ui.system.script_saved" = "Saved";
"ui.system.script_reset" = "Reset";
"ui.system.script_reload" = "Reload";
"toast.reason.file_missing" = "File not found (check path)";
"update.section" = "Updates";
"update.check" = "Check for Updates";
"update.checking" = "Checking…";
"update.up_to_date" = "You're up to date";
"update.available" = "%@ available";
"update.last_checked" = "Last checked: %@";
"update.frequency" = "Check automatically";
"update.frequency.at_launch" = "Every launch";
"update.frequency.daily" = "Daily";
"update.frequency.weekly" = "Weekly";
"update.frequency.never" = "Never";
"update.available_title" = "New version %@";
"update.current_version" = "Current version: %@";
"update.no_notes" = "No release notes.";
"update.howto_title" = "How to update";
"update.howto_body" = "Download the DMG, drag ApexKey to Applications, then right-click → Open on first launch.";
"update.download" = "Download";
"update.close" = "Close";
"menu.check_update" = "Check for Updates…";
"ui.automation.soon" = "Coming soon";
"ui.automation.weekday" = "Weekday";
"ui.automation.month_day_fmt" = "Day %@";
"repeat.rule" = "Repeat rule";
"palette.esc_key" = "esc";
"unit.characters" = "Characters";
"unit.words" = "Words";
"unit.lines" = "Lines";
"unit.sentences" = "Sentences";
"style.decimal" = "Decimal";
"style.percent" = "Percent";
"style.currency" = "Currency";
"style.scientific" = "Scientific";
"style.words" = "Written out";
"error.user.text_empty" = "Text is empty";
"error.user.text_pattern_missing" = "Enter a search string or pattern";
"error.user.text_pattern_invalid" = "Invalid regular expression";
"error.user.text_not_number" = "Not a number";
"error.user.clipboard_unavailable" = "Clipboard is unavailable";
"ui.text_action.input" = "Input text";
"ui.text_action.input_hint" = "Input text (Magic Variables supported)";
"ui.text_action.clipboard_read_hint" = "Passes the clipboard text to the next step as-is";
"ui.text_action.pattern" = "Search string or pattern";
"ui.text_action.pattern_hint" = "Finds and replaces this string";
"ui.text_action.pattern_match_hint" = "Regular expression (NSRegularExpression)";
"ui.text_action.replacement" = "Replacement";
"ui.text_action.replacement_hint" = "Use $1 back-references for patterns";
"ui.text_action.match_all" = "Collect all matches";
"ui.text_action.separator" = "Separator";
"ui.text_action.separator_split_hint" = "Splits by this separator";
"ui.text_action.separator_combine_hint" = "Joins with this separator";
"ui.text_action.count_unit" = "Count by";
"ui.text_action.number_style" = "Style";
"ui.text_action.decimals" = "Decimal places";
"ui.text_action.grouping" = "Use thousands separator";
"ui.text_action.magic_hint" = "You can use {마법변수:...} tokens in the input field";
"style.case_upper" = "UPPERCASE";
"style.case_lower" = "lowercase";
"style.case_title" = "Title Case";
"style.case_sentence" = "Sentence case";
"style.case_camel" = "camelCase";
"style.case_kebab" = "kebab-case";
"mode.sort_text" = "Alphabetical";
"mode.sort_numeric" = "Numeric";
"math.add" = "Add";
"math.subtract" = "Subtract";
"math.multiply" = "Multiply";
"math.divide" = "Divide";
"math.modulo" = "Modulo";
"math.power" = "Power";
"math.min" = "Minimum";
"math.max" = "Maximum";
"hash.sha256" = "SHA-256";
"hash.sha512" = "SHA-512";
"error.user.text_div_zero" = "Cannot divide by zero";
"error.user.text_expression_deep" = "Expression is too complex";
"error.user.text_expression_invalid" = "Invalid expression";
"error.user.text_base64_invalid" = "Invalid Base64";
"error.user.text_not_utf8" = "Not valid UTF-8 text";
"error.user.text_date_invalid" = "Invalid date format";
"error.user.text_unsupported" = "Unsupported operation";
"error.user.text_count_range" = "Count must be between 1 and 100";
"ui.text_action.no_input_hint" = "Runs from settings alone, no input needed";
"ui.text_action.case_style" = "Case style";
"ui.text_action.sort_mode" = "Sort by";
"ui.text_action.sort_order" = "Order";
"ui.text_action.order_ascending" = "Ascending";
"ui.text_action.order_descending" = "Descending";
"ui.text_action.prefix" = "Prefix";
"ui.text_action.suffix" = "Suffix";
"ui.text_action.math_operation" = "Operation";
"ui.text_action.separator_math_hint" = "Separator for operands (blank = newline)";
"ui.text_action.base64_direction" = "Direction";
"ui.text_action.base64_encode" = "Encode";
"ui.text_action.base64_decode" = "Decode";
"ui.text_action.hash_algorithm" = "Hash algorithm";
"ui.text_action.uuid_count" = "How many";
"ui.text_action.date_format" = "Date format";
"ui.text_action.date_format_hint" = "DateFormatter pattern (yyyy-MM-dd HH:mm:ss)";
"error.user.text_no_permission" = "Accessibility permission required to type";
"error.user.text_no_html" = "No HTML tags found";
"error.user.text_html_unbalanced" = "Could not parse the HTML structure";
"error.user.text_html_too_deep" = "HTML nesting is too deep";
"action.type.text_input" = "Type Text";
"action.type.type_text" = "Type Text";
"action.type.type_number" = "Type Number";
